## Filtering & Logical Conditions (Introduction)
- Filtering is used to extract only required rows from a table based on conditions.
As a data analyst, filtering helps you:
- Focus on relevant data
- Remove noise
- Create subsets for analysis

### Database Connection

In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### Test connection

In [2]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('8.0.42',)]

## Comparison Operators in SQL

Comparison operators are used in the `WHERE` clause to compare column values.

Common operators:
- `=`  Equal to
- `>`  Greater than
- `<`  Less than
- `>=` Greater than or equal to
- `<=` Less than or equal to

They are widely used for numeric, date, and logical filtering.

### Display name, age, and city of customers whose age is exactly 24.

In [3]:
%%sql 
select name ,age city from customers 
where age=24;

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('Rahul', 24)]

### Show customers whose age is greater than 25.

In [4]:
%%sql 
select * from customers 
where age>25;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[(2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20)),
 (5, 'Karan', 'Bangalore', 31, datetime.date(2023, 4, 5))]

### Show customers who are 25 years old or younger.

In [5]:
%%sql 
select * from customers 
where age <=25;

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1))]

## Logical Operators in SQL

Logical operators are used to **combine multiple conditions** in the `WHERE` clause.

- `AND` → all conditions must be true
- `OR`  → at least one condition must be true
- `NOT` → negates a condition

Used heavily in real-world business filtering.

### Display name, city, and age of customers who:
- live in Mumbai
- AND are older than 25

In [6]:
%%sql
select * from customers 
where city='Mumbai' and age > 25 ;

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[(4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20))]

### Display name and city of customers who live in Mumbai OR Delhi.

In [7]:
%%sql
select * from customers
where city='Mumbai'or city='Delhi';

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20))]

### Display name and city of customers who do NOT live in Mumbai.

In [8]:
%%sql
select name ,city from customers 
where not city ='Mumbai'

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Ananya', 'Delhi'), ('Aman', 'Pune'), ('Karan', 'Bangalore')]

## IN Operator in SQL

The `IN` operator is used to filter values that match **any value in a list**.

It is cleaner and more readable than multiple OR conditions.

### Display name and city of customers who live in Mumbai, Delhi, or Pune.

In [9]:
%%sql
select name ,city from customers 
where city in ('Mumbai','Delhi','Pune')

 * mysql+pymysql://root:***@localhost/customers
4 rows affected.

[('Rahul', 'Mumbai'),
 ('Ananya', 'Delhi'),
 ('Aman', 'Pune'),
 ('Neha', 'Mumbai')]

### Display name and age of customers whose age is between 25 and 30.

In [10]:
%%sql 
select name,age from customers 
where age between 25 and 30;

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('Ananya', 27), ('Neha', 29)]

## BETWEEN Operator in SQL

The `BETWEEN` operator is used to filter values **within a range**.
It includes both the start and end values.

## LIKE Operator in SQL

The `LIKE` operator is used for **pattern matching** with text data.

Wildcards:
- `%` → any number of characters
- `_` → single character

### Display names of customers whose name starts with the letter 'A'.

In [11]:
%%sql 
select name from customers 
where name like 'A%';

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('Ananya',), ('Aman',)]

### Display names of customers whose name ends with the letter 'A'.

In [12]:
%%sql 
select name from customers 
where name like '%A';

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('Ananya',), ('Neha',)]

## IS NULL and IS NOT NULL

These operators are used to check for **missing (NULL) values**.
Normal comparison operators do not work with NULL.

### Display all customers whose city value is NOT missing.

In [13]:
%%sql 
select * from customers 
where city is not null;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20)),
 (5, 'Karan', 'Bangalore', 31, datetime.date(2023, 4, 5))]

## ADVANCED FILTERING – ANALYSIS

### Display name, city, and age of customers who:  
1.live in Mumbai or Delhi  
2.AND are between 25 and 30 years old

In [14]:
%%sql 

select name, city,age from customers 
where city='Mumbai' or city ='Delhi' and
age between 25 and 30;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Rahul', 'Mumbai', 24), ('Ananya', 'Delhi', 27), ('Neha', 'Mumbai', 29)]

### Display name and signup_date of customers who:
1.signed up after 1st Feb 2023  
2.AND do NOT live in Mumbai

In [15]:
%%sql
select name, signup_date
from  customers
where signup_date > '2023-02-01'
  and  city <> 'Mumbai';

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Ananya', datetime.date(2023, 2, 15)),
 ('Aman', datetime.date(2023, 3, 1)),
 ('Karan', datetime.date(2023, 4, 5))]

### Find customers aged between 23 and 30 from Delhi or Mumbai.

In [17]:
%%sql
select * from customers where 
age between 23 and 30 
and city in ('Delhi','Mumbai')

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20))]

### List customers whose name starts with ‘A’ and signed up in March 2023.

In [22]:
%%sql
select * from customers 
where name like "A%" and 
signup_date between '2023-03-01' and '2023-03-31';

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[(3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1))]

### Find customers NOT from Bangalore and age ≤ 27.

In [24]:
%%sql
select * from customers 
where city <>'Bangalore'and 
age <= 27 ;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1))]